# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!
  
#### Import all the necessary libraries here:

In [1]:
import seaborn as sns
import numpy as np
from scipy import stats
import pandas as pd

# Challenge 1

#### Read the `employees` dataset
Save your data in a variable called `employees`.

In [5]:
employees = pd.read_csv('Employee.csv')

In [6]:
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean `Salary` by `Department`?
**Tip**: There are 2 ways to do it: with or without pivot tables. Do it both ways.

In [8]:
# Method 1
employees.groupby('Department')['Salary'].mean()

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

In [56]:
employees.pivot_table(index='Department', columns='Salary', aggfunc=np.mean)

           Years
Salary        30   35   55   60   70
Department
HR           2.0  4.0  NaN  NaN  8.0
IT           2.0  1.0  NaN  7.0  8.0
Sales        NaN  NaN  2.5  NaN  NaN

#### Now, group the data by more than one column. Use Pandas pivot table function to select the mean `Salary` by `Department` and `Title`.

In [55]:
employees.pivot_table(index=['Department','Title'], columns=['Salary'],  aggfunc=np.mean)

                     Years
Salary                  30   35   55   60   70
Department Title
HR         VP          NaN  NaN  NaN  NaN  8.0
           analyst     2.0  4.0  NaN  NaN  NaN
IT         VP          NaN  NaN  NaN  NaN  8.0
           analyst     2.0  1.0  NaN  NaN  NaN
           associate   NaN  NaN  NaN  7.0  NaN
Sales      associate   NaN  NaN  2.5  NaN  NaN

#### Display the number of `Years` of work experience and the `Salary` for each `Title`. Add `Years` as a column in your pivot table.
**Hint**: Use Pandas documentation to explore the [pivot table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) function.

In [91]:
employees.pivot_table(index=['Title'], values = ['Salary'],columns=['Years'],  aggfunc=len)

          Salary
Years          1    2    3    4    7    8
Title
VP           NaN  NaN  NaN  NaN  NaN  2.0
analyst      1.0  2.0  NaN  1.0  NaN  NaN
associate    NaN  1.0  1.0  NaN  1.0  NaN

#### Find the mean `Salary` and number of employees in each `Department` and for each job `Title`.

In [84]:
employees.pivot_table(index=['Department','Title'], columns=['Salary'],  aggfunc=len)

                     Education                     Gender                      \
Salary                      30   35   55   60   70     30   35   55   60   70
Department Title
HR         VP              NaN  NaN  NaN  NaN  1.0    NaN  NaN  NaN  NaN  1.0
           analyst         1.0  1.0  NaN  NaN  NaN    1.0  1.0  NaN  NaN  NaN
IT         VP              NaN  NaN  NaN  NaN  1.0    NaN  NaN  NaN  NaN  1.0
           analyst         1.0  1.0  NaN  NaN  NaN    1.0  1.0  NaN  NaN  NaN
           associate       NaN  NaN  NaN  1.0  NaN    NaN  NaN  NaN  1.0  NaN
Sales      associate       NaN  NaN  2.0  NaN  NaN    NaN  NaN  2.0  NaN  NaN

                     Name                     Years
Salary                 30   35   55   60   70    30   35   55   60   70
Department Title
HR         VP         NaN  NaN  NaN  NaN  1.0   NaN  NaN  NaN  NaN  1.0
           analyst    1.0  1.0  NaN  NaN  NaN   1.0  1.0  NaN  NaN  NaN
IT         VP         NaN  NaN  NaN  NaN  1.0   NaN  NaN  NaN  NaN  1.0
           analyst    1.0  1.0  NaN  NaN  NaN   1.0  1.0  NaN  NaN  NaN
           associate  NaN  NaN  NaN  1.0  NaN   NaN  NaN  NaN  1.0  NaN
Sales      associate  NaN  NaN  2.0  NaN  NaN   NaN  NaN  2.0  NaN  NaN

In [93]:
employees.pivot_table(index=['Department','Title'],  values=['Salary'],  aggfunc=[len, np.mean])

                        len   mean
                     Salary Salary
Department Title
HR         VP             1   70.0
           analyst        2   32.5
IT         VP             1   70.0
           analyst        2   32.5
           associate      1   60.0
Sales      associate      2   55.0

#### For each `Department` and each job `Title`, find the `Salary` median, minimum, maximum and standard deviation. Comment your results.

In [88]:
employees.pivot_table(index=['Department','Title'],  values=['Salary'],  aggfunc=[min, max, np.mean, np.std])

                        min    max   mean       std
                     Salary Salary Salary    Salary
Department Title
HR         VP            70     70   70.0       NaN
           analyst       30     35   32.5  3.535534
IT         VP            70     70   70.0       NaN
           analyst       30     35   32.5  3.535534
           associate     60     60   60.0       NaN
Sales      associate     55     55   55.0  0.000000

In [89]:
"""
The only missing values exist in the Standard deviation aggregation
"""

'\nThe only missing values exist in the Standard deviation aggregation\n'

#### Based on your comments, fill the missing values with an appropriate value.

In [ ]:
employees.pivot_table(index=['Department','Title'],  values=['Salary'],  aggfunc=[min, max, np.mean, np.std])

#### The stake holders want to know, for each `Department`, the number of employees and how much money is spent on salaries. Could you provide that information?

In [ ]:
# your code here

#### For each `Department` and `Title`, find the the total years of work experience and the mean `Salary`.

In [ ]:
# your code here

## Bonus Challenge 1

#### Compute the mean `Salary` after removing the maximum `Salary` for each `Department`. Create the appropriate pivot table.
**Hint**: Write a custom function.

In [ ]:
# your code here

# Challenge 2

#### Read the `fitbit` dataset 
Save your data in a variable called `fitbit`.

In [ ]:
# your code here

#### Explore you dataset in terms of data types and descriptive statistics.
**Hint**: Use Pandas functions from previous lectures.

In [ ]:
# your code here

#### You suspect that there must be a linear relationship between the `Minutes Very Active` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Very active` vs `Steps`. We'll work with matplotlib next week. As a first introduction, uncomment and complete the following code. You need to replace the # symbol for the correct function arguments.

In [ ]:
import matplotlib.pyplot as plt;

In [ ]:
"""
plt.scatter(#, #)
plt.title(#)
plt.xlabel(#)
plt.ylabel(#)
plt.show()
"""

#### What can you say about `Minutes Very Active` and `Steps`? Write a comment below.

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `Minutes Sedentary` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Sedentary` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `MinutesOfSleep` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `MinutesOfSleep` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`.

In [ ]:
columns = ['Calorie burned', 'Steps', 'Floors', 'Minutes Sedentary', 'Minutes Very Active', 'MinutesOfSleep']

In [ ]:
# your code here

#### Based on the result of the correlation matrix, which of the features are highly correlated with variable `Steps`?
**Hint**: sort the correlations of `Steps` vs the rest of the features in descending order. You can use Pandas `sort_values`.

In [ ]:
# your code here

# Challenge 3

#### Read the `time_grades` dataset from Ironhack's database:
* db: `time_grades`
* table: `time_grades`

Save your data in a variable called `time_grades`.

In [ ]:
# your code here

#### Show visually the frequency distribution of the `time_grades` dataset.

In [ ]:
# your code here

#### Is there a correlation between `Study time` and `Grade`? Use both Pearson and Spearman correlations and comment your results.

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Use matplotlib to visually plot `Study time` vs `Grade`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Could you explain the difference between Pearson and Spearman correlations?

In [ ]:
"""
your commments here
"""